Repository: radekzz/wp-image-lazy-load
Catalog: trunk/languages/wp-image-lazy-load-*.po
Languages: cs_cz

source: WP Image Lazy Load Settings page
cs_cz: WP Image Lazy Load nastavení

source: WP Image Lazy Load Settings
cs_cz: WP Image Lazy Load Nastavení

source: Setting of your WP Image Lazy Load plugin
cs_cz: Nastavení vašeho pluginu WP Image Lazy Load

source: Skip iframes:
cs_cz: Přeskočit vnořené rámce:

source: No
cs_cz: Ne

source: Yes
cs_cz: Ano

source: Skip videos:
cs_cz: Přeskočit videa:

source: Skip images in parent element (<strong>css class without dot "."</strong>):
cs_cz: Přeskočit obrázky v nadřazeném elementu (<strong>css třída bez tečky "."</strong>):

source: For no skipping, leave empty. Multiple classes split by semicolon (e.g. classOne;classTwo)
cs_cz: Ponechte prázdné pro žádné vynechání. Více css tříd oddělte středníkem (např. tridaJedna;tridaDve)

source: Skip iframes in parent element (<strong>css class without dot "."</strong>):
cs_cz: Přeskočit vnořené rámce v nadřazeném elementu (<strong>css třída bez tečky "."</strong>):

source: Example of use parent element:
cs_cz: Příklad použití nadřazeného elementu:

source: In options field insert <code class="html">parent</code>
cs_cz: V poli nastavení vložte <code class="html">nadřazený</code>

source: Load elements on custom position:
cs_cz: Načíst elementy na vlastní pozici:

source: Use animations:
cs_cz: Použít animace:

source: (excluding background images)
cs_cz: (kromě obrázků na pozadí)

source: Animation duration:
cs_cz: Dobra trvání animace:

source: Animation timing:
cs_cz: Časování animace:

source: Modify theme files to be lazy loaded
cs_cz: Upravit soubory šablony aby byly obrázky načítány postupně

source: This plugin is using JS lazy loading but also PHP img source blocking in content, if you want to use it also in your theme files, you can modify <i>&lt;img&gt;</i> tags in your theme files to be lazy loaded by PHP.
cs_cz: Tento plugin využívá JS k pozvolnému načítání, ale také PHP pro blokování zdrojů obrázků v obsahu, pokud chcete tuto funkci využít také v souborech vaší šablony, můžete upravit <i>&lt;img&gt;</i> v jejích souborech.

source: If you will get an error, you should check CHMOD is set to <i>read-write</i> rights.
cs_cz: Pokud se objeví chyba, zkontrolujte, že jsou CHMOD práva k souborům s oprávněním <i>čtení-zápis</i>.

source: This action is revertable, but we <b>recommend</b> to backup your files first.
cs_cz: Tato akce je vratná, ale <b>doporučujeme</b> předtím zálohovat vaše soubory.

source: If you like this plugin, please donate us for faster upgrade
cs_cz: Pokud se vám plugin líbí, můžete nám přispět na další vývoj

source: Image lazy load plugin to boost page load time and save bandwidth by removing all the images, background-images, responsive images, iframes and videos. Elements will load just when reach visible part of screen. Lazy loading can be also applied on themes.
cs_cz: Image lazy load plugin pro zrychlení načítání stránky a úsporu načtených dat odstraněním obrázků, obrázků na pozadí, responsivních obrázků, vnořených rámců a videí. Elementy se budou načítat pouze tehdy, pokud uživatel dosáhne úrovně na viditelném místě obrazovky.

source: Radek Mezulanik
cs_cz: Radek Mezuláník
